# running in fifo_sync_prove_fifo_sync/src/
read -formal -DFIFO_SYNC fifo_sync.v
prep -top fifo_sync

memory_nordff
async2sync
chformal -assume -early
chformal -live -fair -cover -remove
opt_clean
setundef -anyseq
opt -keepdc -fast
check
hierarchy -simcheck
write_ilang ../model/design.il
