# running in formal/fifo_sync_prove_fifo/model/
read_ilang design.il
scc -select; simplemap; select -clear
memory_nordff
clk2fflogic
opt_clean
formalff -setundef -clk2ff -ff2anyinit
chformal -live -fair -cover -remove
opt_clean
check
setundef -undriven -anyseq
opt -fast
rename -witness
opt_clean
write_rtlil ../model/design_prep.il
