# running in fifo_async_cover_fifo/src/
read_verilog -formal fifo_async.v
prep -top fifo_async

memory_nordff
clk2fflogic
chformal -live -fair -remove
opt_clean
setundef -anyseq
opt -keepdc -fast
check
hierarchy -simcheck
write_ilang ../model/design.il
